{
    "topic": "Machine Learning",
    "content": "Page 1 of 3 \n \n \n \nSOEN 305 \nKISII \nUNIVERSITY \nUNIVERSITY EXAMINATIONS \nTHIRD YEAR EXAMINATION FOR THE AWARD OF THE  \nDEGREE OF BACHELOR OF SCIENCE IN SOFTWARE ENGINEERING \nFIRST SEMESTER, 2023/2024 \n(AUGUST-DECEMBER, 2023)  \nSOEN 305: OBJECT ORIENTED PROGRAMMING II [JAVA] \nSTREAM:  Y3 S1  \n \n \n \n \n \nTIME:   2 HOURS  \nDAY: TUESDAY, 03.00–02:00 PM \n \n \n         DATE: 21/11/2023 \n \nINSTRUCTIONS  \n1. Do not write anything on this question paper. \n2. Answer Question ONE [Compulsory] and any other TWO Questions. \n \nQUESTION ONE (30 MARKS) \n(a) In your words, describe object oriented programming \n \n \n \n(2 marks) \n(b) What \nare \nabstract \nmethods? \nDescribe \nthe \ncircumstances \nin \nwhich \nan \nabstract \nmethod would be appropriate  \n \n \n \n \n \n \n(2 marks) \n(c)  \ni. Create a class called invoice that a hardware store might use to represent an \ninvoice for an item sold at the store. An invoice should include 4 pieces of \ninformation as instance variables; a part number (type string), a part description \n(type string), a quantity of the item being purchased (type int) and a price per item(double). \n \n \n \n \n \n \n \n \n \n \n \n(5 marks) \nii. . Your class should have a constructor that initializes the 4 instance variables. \nProvide a set and a get method for each of the 4 instance variables. In addition \nprovide a method named getInvoiceAmount that calculates the invoice amount i.e. multiplies \nthe quantity by the price per item, then returns the amount as a double value. If the quantity is \nnot positive, it should be set to 0.0. (5 marks) \niii. Write a test application named invoiceTest that demonstrates class invoice’s \ncapabilities. \n \n \n \n \n \n \n \n \n(5 marks) \n \nPage 2 of 3 \n \n \n(d) Explain how: \ni. The super reference is important to a child class.  \n \n \n(2 marks) \nii. Inheritance support polymorphism \n \n \n \n \n(2 marks) \n(e) Describe the principles of the object oriented paradigm \n \n \n \n(7 marks) \n \n \n \n \nQUESTION TWO (20 marks) \n(a) As a software developer, discuss briefly the various error and exception handling options available \nin Java. \n \n \n \n \n \n \n \n(6 marks) \n(b) Write a complete java/C++ program that prompt the \nuser to enter two non-negative integer number. Your \nprogram should handle bad input data through the use \nof a try/catch block to handle the \ninputMismathException \n \n \n \n \n(8 marks) \n(c) Explain the difference between implementing an \ninterface and a derived class. Give code illustrations.\n \n \n \n \n \n \n \n \n \n(6 marks) \n \n \n \n \nQUESTION THREE (20 marks) \n(a) Consider a SurveyTaker class, which can be used to \ncollect data from a yes/no survey.  \ni.  In the class definition, clearly identify one of each \nof the following components:  field, constructor, method, parameter (4 marks) \nii. What would happen if the user called the enterResponse method with an input value other \nthan \"yes\" or \"no\"? For example, suppose the user entered \"maybe\" in the input box when \nprompted. Would an error occur? If not, what would the method do? Explain your answer. \n  \n \n \n \n(5 marks) \niii. Discuss the context of use of this keyword in this code. \n \n \n(3 marks) \niv. Write an application to test the capability of the SurveyTaker class.  \n (8 marks) \n \n(b) Discuss the concept of method overloading and method overriding as used in object oriented \nprogramming. Write simple java codes that illustrates the concepts.  \n \n(8 marks) \n \nQUESTION FOUR (20 marks) \npublic class SurveyTaker {   \nprivate int numOfYes;  \nprivate int numOfNo;  \npublic SurveyTaker() {  \nthis.numOfYes = 0;  \nthis.numOfNo = 0;  \n}  \npublic void enterResponse(String response) {  \nif (response.equals(\"yes\")) { \nthis.numOfYes++;  \n} else if (response.equals(\"no\")) { \nthis.numOfNo++;  \n} }  \npublic int getYesses() {  \nreturn this.numOfYes;  \n}  \n} \nPage 3 of 3 \n \n(a) Write a program to generate the Graphical User Interface(GUI)with two buttons labelled IN \nand OUT. If the user clicks the IN button, the message “DOCTOR IS IN” flashes and if the \nuser click OUT button the message “DOCTOR IS OUT” flashes. \n (8 marks) \n \n \n \n \n(b) Bu use of examples, discuss the concept of method overloading and method overriding as used \nin object oriented programming. \n \n \n \n \n(8 marks) \n(c) Explain the advantage for programming your GUI in an applet environment vs SWING \n \n \n \n \n               (4 marks)  \n \n \n \n \nQUESTION FIVE (20 MARKS) \n(a) Write a java program to create a class ‘STUDENT’ with data members Rgno, Name, Course, \nBranch, and Semester. Store them in an array of objects. \n \n \n \n(5 marks) \n(b) Write an applet that will display the resulting GUI below.  \n \n \n(15 marks) \n  \n \n"
}